[
    {
        "id":1,
        "slug":"Learn-Python",
        "title":"Learn Python",
        "desc":"Python is a computer programming language often used to build websites and software, automate tasks, and conduct data analysis",
        "content":"<div class=\"col-sm-12\">\r\n\r\n<div class=\"row\">\r\n<div class=\"col-sm-8\">\r\n<h1 class=\"heading-1\">Python® – the language of today and tomorrow<\/h1>\r\n\r\n<p><br>Python is the gift that keeps on giving. The more you understand Python, the more you can do in the 21st Century. As simple as that.<\/p>\r\n<\/div>\r\n\r\n<div class=\"col-sm-4\">\r\n\r\n<center><img src=\"https:\/\/pythoninstitute.org\/assets\/620f5c4d55897355871095.png\" width=\"135px\"><\/center>\r\n\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n\r\n<h2>What<\/h2>\r\n\r\n<p>Python is a widely-used, interpreted, object-oriented, and high-level programming language with dynamic semantics, used for general-purpose programming. It’s everywhere, and people use numerous Python-powered devices on a daily basis, whether they realize it or not.<\/p>\r\n\r\n<br>\r\n\r\n<h2>Who<\/h2>\r\n\r\n<div class=\"row\">\r\n<div class=\"col-sm-8\">\r\n<p>Python was created by <ag hrefd=\"https:\/\/gvanrossum.github.io\/\" target=\"_blank\">Guido van Rossum<\/a>, and first released on February 20, 1991. While you may know the python as a large snake, the name of the Python programming language comes from an old BBC television comedy sketch series called <i>Monty Python’s Flying Circus<\/i>.<\/p>\r\n\r\n<p>One of the amazing features of Python is the fact that it is actually one person’s work. Usually, new programming languages are developed and published by large companies employing lots of professionals, and due to copyright rules, it is very hard to name any of the people involved in the project. Python is an exception.<\/p>\r\n\r\n<p>Of course, Guido van Rossum did not develop and evolve all the Python components himself. The speed with which Python has spread around the world is a result of the continuous work of thousands (very often anonymous) programmers, testers, users (many of them aren’t IT specialists) and enthusiasts, but it must be said that the very first idea (the seed from which Python sprouted) came to one head – Guido’s.<\/p>\r\n\r\n<p>Python is maintained by the <ag hrefd=\"https:\/\/www.python.org\/psf-landing\/\" target=\"_blank\">Python Software Foundation<\/a>, a non-profit membership organization and a community devoted to developing, improving, expanding, and popularizing the Python language and its environment.<\/p>\r\n<\/div>\r\n\r\n<div class=\"col-sm-4\">\r\n<img src=\"https:\/\/pythoninstitute.org\/assets\/620e5e953ea6c215975676.jpg\" alt=\"Guido\" height=\"400\">\r\n<\/div>\r\n\r\n<\/div>\r\n\r\n<br>\r\n\r\n<h2>Why<\/h2>\r\n\r\n<p>Python is omnipresent, and people use numerous Python-powered devices on a daily basis, whether they realize it or not. There are billions of lines of code written in Python, which means almost unlimited opportunities for code reuse and learning from well-crafted examples. What’s more, there is a large and very active Python community, always happy to help.<\/p>\r\n\r\n<p>There are also a couple of factors that make Python great for learning:<\/p>\r\n<ul>\r\n<li>It is easy to learn – the time needed to learn Python is shorter than for many\r\nother languages; this means that it’s possible to start the actual\r\nprogramming faster;<\/li>\r\n<li>It is easy to use for writing new software – it’s often possible to write code\r\nfaster when using Python;<\/li>\r\n<li>It is easy to obtain, install and deploy – Python is free, open and\r\nmultiplatform; not all languages can boast that.<\/li>\r\n<\/ul>\r\n\r\n<p>Programming skills prepare you for careers in almost any industry, and are required if you want to continue to more advanced and higher-paying software development and engineering roles. Python is the programming language that opens more doors than any other. With a solid knowledge of Python, you can work in a multitude of jobs and a multitude of industries. And the more you understand Python, the more you can do in the 21st Century. Even if you don’t need it for work, you will find it useful to know.<\/p>\r\n\r\n\r\n<h2>Where<\/h2>\r\n\r\n<p>Python is the programming language that opens more doors than any other. With a solid knowledge of Python, you can work in a multitude of jobs and a multitude of industries. And even if you don’t need it for work, you will still find it useful to know to speed certain things up or develop a deeper understanding of other concepts.<\/p>\r\n\r\n<p>Python is a great choice for career paths related to software development, engineering, DevOps, machine learning, data analytics, web development, and testing. What's more, there are also many jobs outside the IT industry that use Python. Since our lives are becoming more computerized every day, and the computer and technology areas previously associated only with technically gifted people are now opening up to non-programmers, Python has become one of the must-have tools in the toolbox of educators, managers, data scientists, data analysts, economists, psychologists, artists, and even secretaries.<\/p>\r\n\r\n<br>\r\n\r\n<div class=\"row-full\">\r\n<img class=\"img-skos\" src=\"https:\/\/pythoninstitute.org\/assets\/620fa126a4d71071437588.png\" width=\"100%\">\r\n<\/div>\r\n\r\n<div class=\"negativ row-full\">\r\n<div class=\"container\">\r\n<div class=\"row\">\r\n<div class=\"col-sm-12\">\r\n\r\n<h2>How<\/h2>\r\n\r\n<p><b>Learn, certify, and succeed!<\/b> How great would it be to write your own computer program? Python is a multi-paradigm programming language used by startups and tech giants like Google, Facebook, Cisco, Netflix, and more. With intuitive, readable syntax, Python is a great first programming language to learn. Get started with the <ag hrefd=\"https:\/\/edube.org\/study\/pe1\" target=\"_blank\">Python Essentials 1<\/a> course and prepare for the PCEP certification exam. If you already know the core fundamentals of Python, progress to <ag hrefd=\"https:\/\/edube.org\/study\/pe2\" target=\"_blank\">Python Essentials 2<\/a>, and prepare for the PCAP certification exam. If you work with Python and need to advance to more specialized areas of programming, pick our professional-series courses and prepare for the PCPP and specialization-track certifications.<\/p>\r\n\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n\r\n<div class=\"row-full\">\r\n<img class=\"img-skos\" src=\"https:\/\/pythoninstitute.org\/assets\/620fa3513a11e060229465.png\" width=\"100%\">\r\n<\/div>\r\n\r\n<br>\r\n\r\n<h1 class=\"heading-1\">Python goals<\/h1>\r\n\r\n<p>In 1999, Guido van Rossum defined his goals for Python:<\/p>\r\n\r\n<ul>\r\n<li>an easy and intuitive language just as powerful as those of the major competitors;<\/li>\r\n<li>open source, so anyone can contribute to its development;<\/li>\r\n<li>code that is as understandable as plain English;<\/li>\r\n<li>suitable for everyday tasks, allowing for short development times.<\/li>\r\n<\/ul>\r\n\r\n<p>20+ years later, it is clear that all these intentions have been fulfilled. Some sources say that Python is the first-most popular programming language in the world, while others claim it’s the third.<\/p>\r\n\r\n<p>Either way, it occupies the first position in the top ten of the <ag hrefd=\"https:\/\/www.tiobe.com\/tiobe-index\/\" target=\"blank\">TIOBE Programming Community<\/a> and <ag hrefd=\"https:\/\/pypl.github.io\/PYPL.html\" target=\"_blank\">PYPL PopularitY of Programming Language<\/a> Indexes. (February 2022)<\/p>\r\n\r\n<p>Python isn’t a young language. It is mature and trustworthy. It’s not a one-hit wonder. It’s a bright star in the programming firmament, and time spent learning Python is a very good investment.<\/p>\r\n\r\n<br>\r\n\r\n<div class=\"row\">\r\n<div class=\"col-sm-6\">\r\n\r\n<center><img src=\"https:\/\/pythoninstitute.org\/assets\/620e4c1acea37426050716.png\" alt=\"TIOBE Index 2022\" height=\"350\"><\/center><\/div>\r\n\r\n\r\n\r\n<div class=\"col-sm-6\">\r\n\r\n<center><img src=\"https:\/\/pythoninstitute.org\/assets\/620e4c30aa1c5814917273.png\" alt=\"TIOBE Index 2022\" height=\"350\"><\/center><\/div>\r\n\r\n<\/div>\r\n\r\n\r\n<br>\r\n\r\n\r\n<br>\r\n\r\n<div class=\"container\">\r\n<div class=\"row\">\r\n<div class=\"col-sm-12\">\r\n\r\n<h1>Python in Action<\/h1>\r\n\r\n<p>Where can we see Python in action? We see it every day and almost everywhere. It’s used extensively to implement complex Internet services like search engines, cloud storage and tools, social media and so on. Whenever you use any of these services, you are actually very close to Python, although you wouldn’t know it.<\/p>\r\n\r\n<p>Many developing tools are implemented in Python. More and more everyday use applications are being written in Python. Lots of scientists have abandoned expensive proprietary tools and switched to Python. Lots of IT project testers have started using Python to carry out repeatable test procedures. The list is long.<\/p>\r\n\r\n<br><br>\r\n\r\n<h2>Python examples<\/h2>\r\n\r\n<p>Python is a great choice for:<\/p>\r\n\r\n<ul>\r\n<li>Web and Internet development (e.g., Django and Pyramid frameworks, Flask and Bottle micro-frameworks)<\/li>\r\n<li>Scientific and numeric computing (e.g., SciPy – a collection of packages for the purposes of mathematics, science, and engineering; Ipython – an interactive shell that features editing and recording of work sessions)<\/li>\r\n<li>Education (it’s a brilliant language for teaching programming!)<\/li>\r\n<li>Desktop GUIs (e.g., wxWidgets, Kivy, Qt)<\/li>\r\n<li>Software Development (build control, management, and testing – Scons, Buildbot, Apache Gump, Roundup, Trac)<\/li>\r\n<li>Business applications (ERP and e-commerce systems – Odoo, Tryton)<\/li>\r\n<li>Games (e.g., Battlefield series, Sid Meier’s Civilization IV…), websites and services (e.g., Dropbox, UBER, Pinterest, BuzzFeed...)<\/li>\r\n<li>...<\/li>\r\n<\/ul>\r\n\r\n<p>And that’s just the beginning.<\/p>\r\n\r\n<p>(sources: <ag hrefd=\"https:\/\/wiki.python.org\/moin\/PythonProjects\" target=\"_blank\">PythonProjects on Wikipedia<\/a> and <ag hrefd=\"https:\/\/www.python.org\/about\/apps)\" target=\"_blank\">Python.org<\/a>.)<\/p>\r\n\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n<\/div>"
    },
    {
        "id":2,
        "slug":"Learn-Javascript",
        "title":"Learn Javascript",
        "desc":"JavaScript (JS) is a lightweight, interpreted, or just-in-time compiled programming language with first-class functions.",
        "content":"<div class=\"chapter-contents\">\r\n<div class=\"tealeaf-markup\"><h1>Introduction<\/h1>\r\n\r\n<h2><ag name=\"briefhistory\" hrefd=\"#briefhistory\">A Brief JavaScript History<\/a><\/h2>\r\n\r\n<p>JavaScript was created at Netscape Communications by Brendan Eich in 1995. Netscape and Eich designed JavaScript as a scripting language for use with the company's flagship web browser, Netscape Navigator. Initially known as LiveScript, Netscape changed the name to JavaScript so they could position it as a companion for the Java language, a product of their partner, Sun Microsystems. Apart from some superficial syntactic similarities, though, JavaScript is in no way related to the Java programming language.<\/p>\r\n\r\n<p>After its release, more and more browsers started adding JavaScript support. Still, for much of its history JavaScript was not regarded as a serious programming language. Its earliest releases suffered from notable performance and security issues, but developers had no alternatives. If they wanted to run programs in the browser, they had to use JavaScript.<\/p>\r\n\r\n<p>In 2008, the creation of Google's open-source Chrome V8, a high-performance JavaScript engine, provided a crucial turning point for JavaScript. The subsequent proliferation of fast JavaScript engines made it possible for developers to build sophisticated browser-based applications with performance that competed with desktop and mobile applications.<\/p>\r\n\r\n<p>Soon after, Ryan Dahl released an open-source, cross-platform environment called <ag hrefd=\"https:\/\/nodejs.org\/en\/\">Node.js<\/a>. It provided a way to run JavaScript code from outside a browser. It freed JavaScript from the browser's confines and led directly to JavaScript's current popularity. Today, you can use JavaScript to write all kinds of applications, including browser, server, mobile, and desktop applications. Most major online companies today, including Facebook, Twitter, Netflix, and Google, all use JavaScript in their products.<\/p>\r\n\r\n<h2><ag name=\"javascriptsfuture\" hrefd=\"#javascriptsfuture\">JavaScript's Future<\/a><\/h2>\r\n\r\n<p>JavaScript has come a long way since its original implementation: it took a mere 10 days to write it. The JavaScript standard, proposed for the first time as ECMAScript 1 in 1997, is, as of late 2018, in its 9th iteration (ES 2018). The differences between the specifications described in ECMAScript 1 and ES 2018 are immense: they seem to describe different languages. In the intervening years, JavaScript has undergone massive changes. Not everyone agreed with every change, but, taken together, they made JavaScript a more robust, secure, and expressive language.<\/p>\r\n\r\n<p>The JavaScript community of today is arguably the most active community in programming. It sometimes seems that every week sees releases of new tools, frameworks, and libraries. There are preprocessors and transpilers of all sorts available, ranging from programs that translate modern JavaScript programs so older JavaScript engines can run them, to compiling entirely new languages with JavaScript. The JavaScript standard itself is a continuously evolving document, with improvements introduced at a rapid rate. JavaScript engines incorporate the changes almost as rapidly. New operating systems under development (e.g., Google's Fuchsia) are adding support for the development of native applications in JavaScript. All of this means that JavaScript has an exciting future. It's a great time to learn JavaScript!<\/p>\r\n\r\n<h2><ag name=\"abstraction\" hrefd=\"#abstraction\">Abstraction<\/a><\/h2>\r\n\r\n<p>In programming and computer science in general, there is a concept called abstraction. Abstraction ensures that users are far removed from what's happening \"under the hood.\" A simple example should help illustrate the concept.<\/p>\r\n\r\n<p>Think about the mobile phone you use every day to communicate with your friends and loved ones. You want to make and receive calls, use text messaging, check your Facebook\/Twitter accounts and perhaps take some photos. As a user, you use the manufacturer's user interface to access the phone's basic features, but you probably don't know or care how to repair your phone or write software for it.<\/p>\r\n\r\n<p>A phone technician, on the other hand, needs a different type of interface at a lower level of abstraction. She needs to know how the components work together so she can repair phones that aren't working. Software engineers must understand how the software subsystems interoperate and must also concern themselves with the Operating System and software development tools. That, too, is at another lower abstraction level.<\/p>\r\n\r\n<p>A similar analysis applies to computers. The user uses computers to listen to music, send emails, play games, and more. They interact with the applications that make these tasks possible without any knowledge of the low-level details.<\/p>\r\n\r\n<p>Programmers, however, operate at a lower-level of abstraction by using a programming language like JavaScript. JavaScript, in turn, gets processed by a runtime environment (sometimes called an engine) written in some other still-lower-level languages like C++. In turn, these engines convert JavaScript code into other even lower-level code until, after several iterations, the original JavaScript code ends up as a series of 1s and 0s that the computer understands. In effect, every programming language requires lower level layers of code that make it easy to use.<\/p>\r\n\r\n<p>There are also higher-level abstractions. Some JavaScript programmers use the language to design and build tools that operate at a higher level, including libraries and frameworks like jQuery and React that are popular today. These tools let JavaScript developers build programs on top of existing components, without needing to know how to implement the features they provide.<\/p>\r\n\r\n<p>As a beginner, it's vital for you to understand how JavaScript, the programming language, and the trendy tools and frameworks that you may have heard about, are at two different levels of abstraction. It's possible to learn the basics of some of these tools without understanding JavaScript; however, to fully take advantage of their power, you must understand the fundamentals first. Learning JavaScript to depth helps you better understand frameworks, and reading and maintaining programs that use those frameworks becomes easier. Understanding lower levels of abstraction will help you make better use of tools with higher abstraction levels. This book teaches you JavaScript so that you can recognize and use higher level abstractions with more granularity.<\/p>\r\n\r\n<h2><ag name=\"whothisbookisfor\" hrefd=\"#whothisbookisfor\">Who This Book is For<\/a><\/h2>\r\n\r\n<p>This book's intended audience is the inexperienced or brand-new programmer. If you apply the principles and techniques described here, you'll acquire a strong foundation on which to build your JavaScript programming career. You may use this knowledge to continue to learn more integrated concepts.<\/p>\r\n\r\n<p>This book guides you through the common pitfalls and time-sinks that beginners often experience. It also should provide you with enough practice to commit JavaScript's basic syntax to long-term memory and help you acquire a certain level of <strong>muscle memory<\/strong> that will help you as a programmer. With this background, you can focus on solving real-world problems and building applications to solve them.<\/p>\r\n\r\n<p>Being a programmer is often perceived as difficult. It really isn't. It does, however, require a particular temperament: patience, persistence, focus, logic, detail-oriented, etc. When a programmer understands and adopts this temperament, their work becomes less frustrating, more fun, and rewarding.<\/p>\r\n\r\n<p>Perception of a task's difficulty is often inversely proportional to the patience of the person attempting it. If you're patient with yourself and willing to take the time to work through the exercises and apply the concepts, you'll soon develop the temperament you need. Before you realize what's happening, you'll find yourself solving problems with code.<\/p>\r\n\r\n<p>A shift in thinking must take place for most people. That will come with practice. Once it happens, your progress will accelerate. That will, in turn, help you develop the ability to think deeply about any programming problem. Most programmers find that being able to think deeply about problems is satisfying, engaging, and a rewarding perk of programming!<\/p>\r\n\r\n<h2><ag name=\"whatsnotcovered\" hrefd=\"#whatsnotcovered\">What's Not Covered<\/a><\/h2>\r\n\r\n<p>While skimming through the contents of this book, you may notice that it doesn't cover all the topics that other JavaScript books cover. The omissions are intentional: JavaScript and programming are huge topics, and you'll benefit most from focusing on the fundamentals. Our goal is to introduce you to programming. JavaScript, the language, happens to be the vehicle that we are using. As such, it covers the essential information you need to start your journey towards becoming a professional programmer.<\/p>\r\n\r\n<p>Launch School's teaching philosophy centers around <ag hrefd=\"https:\/\/launchschool.com\/mastery\">Mastery Based Learning<\/a>, which means, among other things, that we introduce students to a new topic only when they have mastered the concepts needed to understand that topic. Learning the basic grammar of a programming language and solving computational problems with that language is a complex skill in its own right. You don't want to spend time learning peripheral information until you have the background and experience to solve programming problems with code.<\/p>\r\n\r\n<p>Let's take a brief look at some of the topics that we chose to omit from this book, but which you may find in some other introductory JavaScript material. Bear in mind that we cover all of these topics in depth in our Core Curriculum at Launch School, so we don't ignore them. However, there's a time and a place where a novice programmer is ready to learn about certain topics.<\/p>\r\n\r\n<h3>The DOM API<\/h3>\r\n\r\n<p>Historically, JavaScript was inextricably tied to the DOM (Document Object Model) API, which is what you use to manipulate content on a webpage. It is, in essence, the entire reason the language came about. Those days are past. While the DOM is still a major focus of JavaScript programmers, it's no longer quite so central to the language. Our goal isn't to teach you JavaScript for the DOM, but to teach it as a general programming language. Later, you can choose to add the DOM API to your toolkit, go the server-side route and learn about Node.js, or do something else entirely with your JavaScript knowledge.<\/p>\r\n\r\n<h3>Asynchronous Programming<\/h3>\r\n\r\n<p>In the wild, JavaScript often has to deal with asynchronous operations: for example, requesting and then displaying data from a database. However, this is an advanced feature that is best understood when you have a solid grounding in the basics. There's a reason programmers joke about JavaScript \"callback hell,\" and we don't want to get into that too soon. In the beginning, you won't have the context needed to understand why you need asynchronous operations. For that reason, we don't present it in this book.<\/p>\r\n\r\n<h3>Object-Oriented JavaScript<\/h3>\r\n\r\n<p>Aside from a brief introduction to JavaScript objects, we'll leave the OOP concepts for the future. Right now, you need to focus on basic concepts; you need to absorb those concepts before you're ready to tackle OOP.<\/p>\r\n\r\n<h3>Testing<\/h3>\r\n\r\n<p>Testing is crucial to writing good code; however, we don't believe that an \"introduction to programming\" book is the best place to cover it. Testing is a technique that is best learned after you've faced the problems that it attempts to solve. You need to have written sufficiently large programs to grasp that context. We cover testing extensively in our <ag hrefd=\"https:\/\/launchschool.com\/courses\">Core Curriculum<\/a>.<\/p>\r\n\r\n<h2><ag name=\"howtoreadthisbook\" hrefd=\"#howtoreadthisbook\">How to Read This Book<\/a><\/h2>\r\n\r\n<p>Reading about programming and writing a program aren't the same. If you read this entire book without ever writing a line of code, you may understand, intellectually, how to code, but you won't know how to <strong>do it<\/strong>. If someone asks you to solve a problem with a computer program, you won't be able to complete the task.<\/p>\r\n\r\n<p>There is a \"muscle memory\" aspect to programming that books and courses often overlook. With the vast amount of information that a programmer must remember, practicing some skills until they become automatic is unquestionably crucial. It doesn't require much effort; it happens naturally through repetition and practice. You can learn with your fingers, and, when you do, you free up your brain to focus on higher-level abstractions.<\/p>\r\n\r\n<p>If you want a real shot at learning how to code, you should do every exercise in this book. If you want to learn a musical instrument, you must <em>practice<\/em> your scales on that instrument and develop proficiency before you can <em>play<\/em> the instrument well.<\/p>\r\n\r\n<p>Think of the exercises as though you are a musician practicing musical scales and writing a program as playing the instrument. Use the exercises to practice and cement the basics into your fingers. The more you practice, the more coding becomes second nature and subconscious, and that helps you learn to program.<\/p>\r\n\r\n<p>This book's target audience is the beginner. In the world of computer programming, there is an enormous amount of information to learn; it isn't possible to learn it all. We recognize that, and intentionally avoid topics that aren't beneficial to the beginner. Trust these omissions; we've had some experience with teaching, and know how easy it is to get lost \"down the rabbit hole\" looking for information on unimportant topics. Instead, stay focused. You'll progress at a much faster rate if you do.<\/p>\r\n\r\n<p>That about covers it. Get ready to build the skills you need to become a computer programmer. Don't worry; we'll be here to coach you along the way. Buckle up and enjoy the ride!<\/p>\r\n<\/div>\r\n\r\n<div class=\"next_chapter\">\r\n<ag hrefd=\"\/books\/javascript\/read\/preparations\">Next: &nbsp;Preparations\r\n<i class=\"fa fa-chevron-right\"><\/i>\r\n<\/a><\/div>\r\n<\/div>"
    },
    {
        "id":3,
        "slug":"Learn-Cpp",
        "title":"Learn Cpp",
        "desc":"C++ is an object-oriented programming language which gives a clear structure to programs and allows code to be reused, lowering development costs.",
        "content":"<div id=\"city\">\r\n<table>\r\n<tbody><tr><td>\r\n<div id=\"bottomnextup\">\r\n<ag class=\"next\" hrefd=\"cpp-features\">next →<\/a>\r\n<ag class=\"next\" hrefd=\"what-is-cpp\">← prev<\/a>\r\n<\/div>\r\n<h1 class=\"h1\">C++ history<\/h1>\r\n<p><strong>History of C++ language<\/strong> is interesting to know. Here we are going to discuss brief history of C++ language.<\/p>\r\n<p><strong>C++ programming language<\/strong> was developed in 1980 by Bjarne Stroustrup at bell laboratories of AT&amp;T (American Telephone &amp; Telegraph), located in U.S.A.<\/p>\r\n<p><strong>Bjarne Stroustrup<\/strong> is known as the <strong>founder of C++ language.<\/strong><\/p>\r\n<div style=\"float:right;border:1px solid pink;padding: 2px 2px 2px 2px;\">\r\n<img src=\"https:\/\/static.javatpoint.com\/cpp\/images\/cpp-history1.png\" alt=\"Cpp History 1\" style=\"float:right;\">\r\n<\/div>\r\n<p>It was develop for adding a feature of <strong>OOP (Object Oriented Programming)<\/strong> in C without significantly changing the C component.<\/p>\r\n<p>C++ programming is \"relative\" (called a superset) of C, it means any valid C program is also a valid C++ program.<\/p>\r\n<script async=\"\" src=\"\/\/pagead2.googlesyndication.com\/pagead\/js\/adsbygoogle.js\"><\/script>\r\n\r\n<ins class=\"adsbygoogle cm_jtp_wtc_responsive\" style=\"display: inline-block; width: 336px; height: 280px;\" data-ad-client=\"ca-pub-4699858549023382\" data-ad-slot=\"6746133113\" data-adsbygoogle-status=\"done\" data-ad-status=\"filled\"><div id=\"aswift_0_host\" tabindex=\"0\" title=\"Advertisement\" aria-label=\"Advertisement\" style=\"border: none; height: 280px; width: 336px; margin: 0px; padding: 0px; position: relative; visibility: visible; background-color: transparent; display: inline-block;\"><iframe id=\"aswift_0\" name=\"aswift_0\" style=\"left:0;position:absolute;top:0;border:0;width:336px;height:280px;\" sandbox=\"allow-forms allow-popups allow-popups-to-escape-sandbox allow-same-origin allow-scripts allow-top-navigation-by-user-activation\" width=\"336\" height=\"280\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" vspace=\"0\" hspace=\"0\" allowtransparency=\"true\" scrolling=\"no\" src=\"https:\/\/googleads.g.doubleclick.net\/pagead\/ads?client=ca-pub-4699858549023382&amp;output=html&amp;h=280&amp;slotname=6746133113&amp;adk=3537561028&amp;adf=3410068950&amp;pi=t.ma~as.6746133113&amp;w=336&amp;lmt=1678287218&amp;rafmt=12&amp;format=336x280&amp;url=https%3A%2F%2Fwww.javatpoint.com%2Fcpp-history&amp;wgl=1&amp;uach=WyJBbmRyb2lkIiwiNi4wIiwiIiwiTmV4dXMgNSIsIjExMC4wLjU0ODEuMTc4IixbXSx0cnVlLG51bGwsIjY0IixbWyJDaHJvbWl1bSIsIjExMC4wLjU0ODEuMTc4Il0sWyJOb3QgQShCcmFuZCIsIjI0LjAuMC4wIl0sWyJHb29nbGUgQ2hyb21lIiwiMTEwLjAuNTQ4MS4xNzgiXV0sZmFsc2Vd&amp;dt=1678287216932&amp;bpp=52&amp;bdt=3376&amp;idt=1584&amp;shv=r20230302&amp;mjsv=m202302210101&amp;ptt=9&amp;saldr=aa&amp;abxe=1&amp;cookie=ID%3D37c3e1d0e87352fe-22d472d470d90099%3AT%3D1674795489%3AS%3DALNI_MZmhXZr-KhJkNKPrnCy0zTDQYv9eQ&amp;gpic=UID%3D00000993ec25b8e4%3AT%3D1674795489%3ART%3D1677375003%3AS%3DALNI_Mb6QL73Ta5EuNxhZ0N9fHGpQfFTcw&amp;correlator=6671953277533&amp;frm=20&amp;pv=2&amp;ga_vid=94850736.1674795479&amp;ga_sid=1678287219&amp;ga_hid=1831444&amp;ga_fc=1&amp;u_tz=330&amp;u_his=5&amp;u_h=658&amp;u_w=688&amp;u_ah=658&amp;u_aw=688&amp;u_cd=24&amp;u_sd=2&amp;dmc=4&amp;adx=19&amp;ady=521&amp;biw=688&amp;bih=658&amp;scr_x=0&amp;scr_y=0&amp;eid=44777877%2C44759837%2C44759875%2C44759926&amp;oid=2&amp;pvsid=143792707912584&amp;tmod=333621707&amp;uas=3&amp;nvt=1&amp;ref=https%3A%2F%2Fwww.google.com%2F&amp;fc=896&amp;brdim=0%2C0%2C0%2C0%2C688%2C0%2C688%2C658%2C688%2C658&amp;vis=1&amp;rsz=%7C%7CeE%7C&amp;abl=CS&amp;pfx=0&amp;fu=256&amp;bc=31&amp;ifi=1&amp;uci=a!1&amp;fsb=1&amp;xpc=l2CoSbvroS&amp;p=https%3A\/\/www.javatpoint.com&amp;dtd=1917\" data-google-container-id=\"a!1\" data-google-query-id=\"CNyHsY3LzP0CFeKFrAId-vEFDA\" data-load-complete=\"true\"><\/iframe><div class=\"adp-interscroller-container\"><div class=\"adp-interscroller-ad-label-top\">ADVERTISEMENT<\/div><div class=\"adp-interscroller-outer-div\"><div class=\"adp-interscroller-inner-div\"><div id=\"1ae2b756-4481-418d-84d4-b18544b4d11e\" data-section=\"1ae2b756-4481-418d-84d4-b18544b4d11e\" class=\"_ap_apex_ad\" data-xpath=\"\" data-section-id=\"2\" data-ap-network=\"adpTags\" style=\"display: block; clear: both; text-align: center; margin: 10px auto; width: 300px; height: 250px; overflow: hidden;\" data-render-time=\"1678287229362\" data-refresh-time=\"1678287234352\" data-timeout=\"100\"><div id=\"ADP_37780_300X250_1ae2b756-4481-418d-84d4-b18544b4d11e\" style=\"text-align: center; margin: 0 auto;\">\r\n<script type=\"text\/javascript\">\r\nwindow.adpushup.adpTags.que.push(function(){\r\nwindow.adpushup.adpTags.display(\"ADP_37780_300X250_1ae2b756-4481-418d-84d4-b18544b4d11e\");\r\n});\r\n<\/script>\r\n<\/div><\/div><\/div><\/div><div class=\"adp-interscroller-ad-label-bottom\">ADVERTISEMENT<\/div><\/div><\/div><\/ins>\r\n<script>\r\n(adsbygoogle = window.adsbygoogle || []).push({});\r\n<\/script>\r\n<p>Let's see the programming languages that were developed before C++ language.<\/p>\r\n<table class=\"alt\">\r\n<tbody><tr>\r\n<th>Language<\/th>\r\n<th>Year<\/th>\r\n<th>Developed By<\/th>\r\n<\/tr>\r\n<tr>\r\n<td>Algol<\/td>\r\n<td>1960<\/td>\r\n<td>International Group<\/td>\r\n<\/tr>\r\n<tr>\r\n<td>BCPL<\/td>\r\n<td>1967<\/td>\r\n<td>Martin Richard<\/td>\r\n<\/tr>\r\n<tr>\r\n<td>B<\/td>\r\n<td>1970<\/td>\r\n<td>Ken Thompson<\/td>\r\n<\/tr>\r\n<tr>\r\n<td>Traditional C<\/td>\r\n<td>1972<\/td>\r\n<td>Dennis Ritchie<\/td>\r\n<\/tr>\r\n<tr>\r\n<td>K &amp; R C<\/td>\r\n<td>1978<\/td>\r\n<td>Kernighan &amp; Dennis Ritchie<\/td>\r\n<\/tr>\r\n<tr>\r\n<td>C++<\/td>\r\n<td>1980<\/td>\r\n<td>Bjarne Stroustrup<\/td>\r\n<\/tr>\r\n<\/tbody><\/table>\r\n<div class=\"nexttopicdiv\">\r\n<span class=\"nexttopictext\">Next Topic<\/span><span class=\"nexttopiclink\"><ag hrefd=\"cpp-features\">C++ Features<\/a><\/span>\r\n<\/div>\r\n\r\n<br><br>\r\n<div id=\"bottomnext\">\r\n<ag style=\"float:left\" class=\"next\" hrefd=\"what-is-cpp\">← prev<\/a>\r\n<ag style=\"float:right\" class=\"next\" hrefd=\"cpp-features\">next →<\/a>\r\n<\/div>\r\n<br><br>\r\n<\/td><\/tr><\/tbody><\/table>\r\n<\/div>"
    }
]